**In these notebook we clearly understand about numpy and practice some codes with it**

NumPy (Numerical Python) is a Python library that adds support for large, multi-dimensional arrays and matrices, along with a large collection of high-level mathematical functions to operate on these arrays. NumPy is open-source software and has many contributors. NumPy is a NumFOCUS fiscally sponsored project

we can perform large number of numerical operation using numpy

In [1]:
import numpy as np
import pandas as pd

In [9]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['c1','c2','c3','c4'])

In [10]:
df.head()

      c1  c2  c3  c4
row1   0   1   2   3
row2   4   5   6   7
row3   8   9  10  11
row4  12  13  14  15
row5  16  17  18  19

In [5]:
df.shape

(5, 4)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      int32
 1   1       5 non-null      int32
 2   2       5 non-null      int32
 3   3       5 non-null      int32
dtypes: int32(4)
memory usage: 208.0 bytes

In [13]:
#loc & iloc By using loc you will be able to call only one row and using iloc you will be able to call row and coluns
df.loc['row3']

c1     8
c2     9
c3    10
c4    11
Name: row3, dtype: int32

In [29]:
#loc basically means indexed
#df.loc[(df['c1']==8) & df['row2']==6]

In [15]:
df.iloc[:,:-1] #calling all rows and columns except the last one

      c1  c2  c3
row1   0   1   2
row2   4   5   6
row3   8   9  10
row4  12  13  14
row5  16  17  18

In [16]:
df.iloc[:,-1]#calling all rows and only one column

row1     3
row2     7
row3    11
row4    15
row5    19
Name: c4, dtype: int32

In [72]:
row ={"sex":['male','male','male','male','female','female','null'],
     "Embarked":['S',"S",'S','C','C','L','h'],
     'name':['Bishu','sai','sam','hoe','john','doe','sul'],
     'age':[25,34,33,33,56,45,0 ]}
c=pd.DataFrame(row)
c.head()

      sex Embarked   name  age
0    male        S  Bishu   25
1    male        S    sai   34
2    male        S    sam   33
3    male        C    hoe   33
4  female        C   john   56

In [46]:
c.loc[(c['sex']=='male')&(c['age']<=33)]

    sex Embarked   name  age
0  male        S  Bishu   25
2  male        S    sam   33
3  male        C    hoe   33

In [47]:
c.loc[0:2,['name','age']]

    name  age
0  Bishu   25
1    sai   34
2    sam   33

In [48]:
c.iloc[0:4,1:4]

  Embarked   name  age
0        S  Bishu   25
1        S    sai   34
2        S    sam   33
3        C    hoe   33

In [49]:
c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sex       6 non-null      object
 1   Embarked  6 non-null      object
 2   name      6 non-null      object
 3   age       6 non-null      int64
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [50]:
c.head()

      sex Embarked   name  age
0    male        S  Bishu   25
1    male        S    sai   34
2    male        S    sam   33
3    male        C    hoe   33
4  female        C   john   56

In [66]:
c['sex']=np.where(c['sex']=='male',1,0)

TypeError: tuple indices must be integers or slices, not str